Day4/Rails/todoapp/app/controllers/todos_controller.rb

INSERT INTO "todos" ("name", "description") VALUES (?, ?)  [["name", "Ola"], ["description", "A Todo"]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save

UPDATE "todos" SET "name" = ?, "description" = ? WHERE "todos"."id" = ?  [["name", "Ola Kveli"], ["description", "Edit test"], ["id", 10]]
---
  def update
      if @todo.update(todo_params)